Revit 2026 API

# MatchlineFailures Properties

---

The BuiltInFailuresMatchlineFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreationFailed | Matchline top extent should be higher than its bottom. |

#### Reference

BuiltInFailuresMatchlineFailures Class

Autodesk.Revit.DB Namespace